tutorials/compressible/steadyCompressibleFoam/bumpBlockMesh/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    INLE1
    {
        type         zeroGradient;

//         type            waveTransmissiveInlet;
//         phi             phi;
//         rho             rho;
//         psi             psi;
//         U               U;
//         gamma           1.4;
//         inletOutlet     false;
//         correctSupercritical false;
//         lInf            0.0;
//         fieldInf        101325;
//         value           uniform 101325;
    }

    PRES2
    {
        type            fixedValue;
        value           uniform 101325;

//         type            waveTransmissive;
//         phi             phi;
//         rho             rho;
//         psi             psi;
//         U               U;
//         gamma           1.4;
//         inletOutlet     false;
//         correctSupercritical true;
//         lInf            0.1;
//         fieldInf        101325;
//         value           uniform 101325;
    }

    WALL3
    {
        type            zeroGradient;
    }

    SYMP5
    {
        type            empty;
    }

    SYMP6
    {
        type            empty;
    }

    WALL4
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
